<?php

/**
 * @license    GPL 2 (http://www.gnu.org/licenses/gpl.html)
 *
 * @author Sam01 <m.sajad079@gmail.com>
 */
$lang['menu']                  = 'ارتقا ویکی';
$lang['vs_php']                = 'نسخه‌های جدید دوکوویکی نیاز به %s پی‌اچ‌پی دارند، اما شما استفاده می‌کنید از %s. قبلا از این کار شما باید نسخه‌ی پی‌اچ‌پی خود را ارتقا دهید.';
$lang['vs_tgzno']              = 'نمی‌توان نسخه‌ی جدیدتر دوکوویکی را مشخص کرد.';
$lang['vs_tgz']                = 'دوکوویکی <b>%s</b> برای دانلود موجود است.';
$lang['vs_local']              = 'شما درحال حاضر دوکوویکی <b>%s</b> را اجرا می‌کنید.';
$lang['vs_localno']            = 'هنوز مشخص نیست که نسخه‌های درحال اجرا چند ساله هستند، ارتقا دستی توصیه می‌شود.';
$lang['vs_newer']              = 'به نظر می‌رسد دوکوویکی اجرایی شما جدیدتر از نسخه‌ی پایدار است. ارتقای دستی توصیه نمی‌شود.';
$lang['vs_same']               = 'دوکوویکی اجرایی شما بروز است. ارتقا لازم نیست.';
$lang['vs_plugin']             = 'ارتقای جدید برای افزونه وجود دارد (%s) شما باید قبل از ادامه‌ دادن افزونه را ارتقا دهید.';
$lang['vs_ssl']                = 'به نظر نمی‌رسد پی‌اچ‌پی شما از جریان SSL حمایت کند،  دانلود داده‌های مورد نیاز با شکست مواجه خواهند شد. ارتقای دستی به جای این ارتقا.';
$lang['dl_from']               = 'درحال دانلود آرشیو از %s...';
$lang['dl_fail']               = 'دانلود ناموفق بود.';
$lang['dl_done']               = 'دانلود تمام شد (%s).';
$lang['pk_extract']            = 'بازکردن بسته‌ی آرشیو...';
$lang['pk_fail']               = 'بازکردن بسته ناموفق بود.';
$lang['pk_done']               = 'بازکردن بسته تمام شد.';
$lang['pk_version']            = 'دوکوویکی <b>%s</b> آماده‌ی نصب است (شما درحال اجرای <b>%s</b> هستید).';
$lang['ck_start']              = 'بررسی مجوز دسترسی فایل';
$lang['ck_done']               = 'تمام فایل‌ها قابل نوشتن هستند. آماده برای بروزرسانی.';
$lang['ck_fail']               = 'بعضی فایل‌ها قابل نوشتن نیستند. ارتقای خودکار امکان‌پذیر نیست.';
$lang['cp_start']              = 'بروزرسانی فایل‌ها...';
$lang['cp_done']               = 'همه‌ی فایل‌ها بروز شد.';
$lang['cp_fail']               = 'اوه. چیزی اشتباه شد. بررسی دستی بهتر است.';
$lang['tv_noperm']             = '<code>%s</code> قابل نوشتن نیست!';
$lang['tv_upd']                = '<code>%s</code> بروزرسانی خواهد شد.';
$lang['tv_nocopy']             = 'نمی‌توان <code>%s</code> را کپی کرد!';
$lang['tv_nodir']              = 'نمی‌توان دایرکتوی <code>%s</code> ایجاد کرد!';
$lang['tv_done']               = '<code>%s</code> بروزرسانی شد';
$lang['rm_done']               = '<code>%s</code> منسوخ حذف شد.';
$lang['rm_fail']               = 'توانایی حذف <code>%s</code> منسوخی نیست. <b>لطفا دستی حذف کنید!</b>';
$lang['finish']                = 'ارتقا پایان یافت. از دوکوویکی جدید لذت ببر.';
$lang['btn_continue']          = 'ادامه';
$lang['btn_abort']             = 'سقط';
$lang['step_version']          = 'بررسی';
$lang['step_download']         = 'دانلود';
$lang['step_unpack']           = 'بازکردن بسته';
$lang['step_check']            = 'بازبینی';
$lang['step_upgrade']          = 'نصب';
$lang['careful']               = 'خطاهای بالا! شما باید <b>نباید</b> ادامه بدهید!';
