<?php

/**
 * @license    GPL 2 (http://www.gnu.org/licenses/gpl.html)
 * 
 * @author Grigory Gubin <gv.gubin@gmail.com>
 * @author Aleksandr Selivanov <alexgearbox@yandex.ru>
 * @author Vladimir Rozhkov <v.s.rozhkov@outlook.com>
 * @author Vitaly Filatenko <kot@hacktest.net>
 * @author TyanNN <sashavini2000@gmail.com>
 */
$lang['menu']                  = 'Обновление вики';
$lang['vs_php']                = 'Новые версии «Докувики» требуют PHP версии не менее %s, но у вас установлена %s. Вы должны обновить PHP до новой версии перед обновлением.';
$lang['vs_tgzno']              = 'Нет возможности определить новую версию «Докувики».';
$lang['vs_tgz']                = '«Докувики» <b>%s</b> доступна для скачивания.';
$lang['vs_local']              = 'У вас запущена «Докувики» <b>%s</b>.';
$lang['vs_localno']            = 'Невозможно определить последнюю установленную версию, рекомендуется ручное обновление. ';
$lang['vs_newer']              = 'Похоже, текущая версия вашей «Докувики» новее последней стабильной сборки. Обновление не рекомендовано.';
$lang['vs_same']               = 'Ваша «Докувики» уже обновлена до последней версии. Обновление не нужно.';
$lang['vs_plugin']             = 'Доступна новая версия плагина обновления (%s). Вы должны переустановить плагин обновления до обновления «Докувики».';
$lang['vs_ssl']                = 'Похоже, что ваш PHP не поддерживает SSL, процесс загрузки может завершиться неудачей. Рекомендуется ручное обновление.';
$lang['dl_from']               = 'Загрузка архива из %s...';
$lang['dl_fail']               = 'Ошибка загрузки.';
$lang['dl_done']               = 'Загрузка завершена (%s).';
$lang['pk_extract']            = 'Распаковка архива...';
$lang['pk_fail']               = 'Ошибка распаковки.';
$lang['pk_done']               = 'Распаковка завершена';
$lang['pk_version']            = '«Докувики» <b>%s</b> уже установлена (текущая установка <b>%s</b>).';
$lang['ck_start']              = 'Проверка прав доступа к файлам...';
$lang['ck_done']               = 'Все файлы доступны для записи. Готово к обновлению.';
$lang['ck_fail']               = 'Некоторые файлы недоступны для записи. Автообновление невозможно.';
$lang['cp_start']              = 'Обновление файлов...';
$lang['cp_done']               = 'Все файлы обновлены.';
$lang['cp_fail']               = 'Ой... Что-то пошло не так. Лучше проверить вручную.';
$lang['tv_noperm']             = 'Не могу записать <code>%s</code>!';
$lang['tv_upd']                = '<code>%s</code> будет обновлён.';
$lang['tv_nocopy']             = 'Невозможно скопировать файл <code>%s</code>!';
$lang['tv_nodir']              = 'Невозможно создать папку <code>%s</code>!';
$lang['tv_done']               = 'обновление <code>%s</code>';
$lang['rm_done']               = 'Устаревший <code>%s</code> удалён.';
$lang['rm_fail']               = 'Невозможно удалить устаревший <code>%s</code>. <b>Пожалуйста, удалите вручную!</b>';
$lang['finish']                = 'Обновление завершено. Наслаждайтесь своей новой «Докувики»';
$lang['btn_continue']          = 'Продолжить';
$lang['btn_abort']             = 'Отменить';
$lang['step_version']          = 'Отменить';
$lang['step_download']         = 'Загрузить';
$lang['step_unpack']           = 'Распаковать';
$lang['step_check']            = 'Проверить';
$lang['step_upgrade']          = 'Установить';
$lang['careful']               = 'Ошибки выше! Продолжать <b>не</b> стоит!';
